docs: replace to mermaid
Closes #1
